Revit 2027 API
DWFImageFormat Enumeration
An enumerated type listing possible image format for DWF Export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DWFImageFormat
Public Enumeration DWFImageFormat
public enum class DWFImageFormat
type DWFImageFormat
Members
Member name | Value | Description
Lossless | 0
Lossy | 1
See Also
Reference
Autodesk.Revit.DB Namespace